app/views/users/index.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 11]]
---
   <td><%= user.gender %></td>
<!--  <%#if user.addresses.present? %>