app/views/users/show.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 59]]
---

<% if @user.addresses.present? %>