app/models/review.rb

	def review_count_increase
		self.hotel.update(review_count: self.hotel.reviews.count)
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."hotel_id" = ?  [["hotel_id", 8]]
UPDATE "hotels" SET "review_count" = ?, "updated_at" = ? WHERE "hotels"."id" = ?  [["review_count", 3], ["updated_at", "2022-04-13 13:30:23.325885"], ["id", 8]]

    def review_count_decrease
    	self.hotel.update(review_count: self.hotel.reviews.count)
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."hotel_id" = ?  [["hotel_id", 10]]
UPDATE "hotels" SET "review_count" = ?, "updated_at" = ? WHERE "hotels"."id" = ?  [["review_count", 1], ["updated_at", "2022-04-14 06:08:10.386221"], ["id", 10]]